app/services/first_session_risk_score_service.rb

SELECT "session_transcripts".* FROM "session_transcripts" WHERE "session_transcripts"."session_id" = 1 LIMIT 1
---
  def transcript_present?
    @session.session_transcript.present?