app/services/performance_summary_service.rb

SELECT "scores"."value" FROM "scores" WHERE "scores"."tutor_id" = 1 AND "scores"."score_type" = 'sqs' ORDER BY "scores"."computed_at" DESC LIMIT 10
---
  def fetch_recent_sqs_scores
    @tutor.scores
      .where(score_type: 'sqs')
      .order(computed_at: :desc)
      .limit(10)
      .pluck(:value)
      .map(&:to_f)