app/services/sqs_actionable_feedback_service.rb

  def generate_feedback
    # Get last 5 SQS scores with components (ordered by session date, not computed_at)
    # This ensures we're looking at the most recent 5 sessions chronologically
    sqs_scores = Score.where(tutor: @tutor, score_type: 'sqs')
                      .joins(:session)
                      .order('sessions.scheduled_start_at DESC')
                      .limit(5)
                      .includes(:session)

    return { perfect: true, message: nil, items: [] } if sqs_scores.empty?

    # Analyze deductions
    deductions = analyze_deductions(sqs_scores)

    # Check if all sessions were perfect (score = 100 and no deductions)
    perfect_sessions = sqs_scores.count do |score|
      score.value.to_f >= 100 &&
      (score.components || {}).values.all? { |v| v.to_f == 0 || v.nil? }
    end

    if perfect_sessions == sqs_scores.count && deductions[:total_sessions_with_deductions] == 0
---
SELECT 1 AS one FROM "scores" WHERE "scores"."tutor_id" = 1 AND "scores"."score_type" = 'sqs' LIMIT 1
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "scores" WHERE "scores"."tutor_id" = 1 AND "scores"."score_type" = 'sqs' LIMIT 10) subquery_for_count