app/controllers/api/admin/alerts/alerts_controller.rb

SELECT "alerts".* FROM "alerts" WHERE "alerts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "alerts" SET "status" = $1, "updated_at" = $2 WHERE "alerts"."id" = $3  [["status", "acknowledged"], ["updated_at", "2025-11-05 08:23:41.187605"], ["id", 12]]
---
        def update_status
          alert = ::Alert.find(params[:id])

          # Update alert status
          new_status = params[:status]
          alert.update!(status: new_status)