app/controllers/api/admin/tutor/tutors_controller.rb

        def metrics
          tutor = ::Tutor.find(params[:id])

          # Get latest scores
          latest_fsrs = tutor.scores.where(score_type: 'fsrs').order(computed_at: :desc).first
---
SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = $1 LIMIT $2  [["id", 66], ["LIMIT", 1]]
SELECT "scores".* FROM "scores" WHERE "scores"."tutor_id" = $1 AND "scores"."score_type" = $2 ORDER BY "scores"."computed_at" DESC LIMIT $3  [["tutor_id", 66], ["score_type", "fsrs"], ["LIMIT", 1]]

        def fsrs_history
          tutor = ::Tutor.find(params[:id])

          # Get all FSRS scores for this tutor
          fsrs_scores = tutor.scores
            .where(score_type: 'fsrs')
            .order(computed_at: :desc)
            .limit(10)
            .map do |score|
---
SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = $1 LIMIT $2  [["id", 67], ["LIMIT", 1]]
SELECT "scores".* FROM "scores" WHERE "scores"."tutor_id" = $1 AND "scores"."score_type" = $2 ORDER BY "scores"."computed_at" DESC LIMIT $3  [["tutor_id", 67], ["score_type", "fsrs"], ["LIMIT", 10]]

        def intervention_log
          tutor = ::Tutor.find(params[:id])

          # Get all resolved alerts (these represent past interventions)
          interventions = tutor.alerts
            .where(status: 'resolved')
            .order(resolved_at: :desc)
            .limit(20)
            .map do |alert|
---
SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
SELECT "alerts".* FROM "alerts" WHERE "alerts"."tutor_id" = $1 AND "alerts"."status" = $2 ORDER BY "alerts"."resolved_at" DESC LIMIT $3  [["tutor_id", 68], ["status", "resolved"], ["LIMIT", 20]]