app/controllers/api/admin/tutor/tutors_controller.rb

        def metrics
          tutor = ::Tutor.find(params[:id])

          # Get latest scores
          latest_fsrs = tutor.scores.where(score_type: 'fsrs').order(computed_at: :desc).first
          latest_ths = tutor.scores.where(score_type: 'ths').order(computed_at: :desc).first
          latest_tcrs = tutor.scores.where(score_type: 'tcrs').order(computed_at: :desc).first
---
SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = 2 LIMIT 1
SELECT "scores".* FROM "scores" WHERE "scores"."tutor_id" = 2 AND "scores"."score_type" = 'fsrs' ORDER BY "scores"."computed_at" DESC LIMIT 1
SELECT "scores".* FROM "scores" WHERE "scores"."tutor_id" = 2 AND "scores"."score_type" = 'ths' ORDER BY "scores"."computed_at" DESC LIMIT 1
SELECT "scores".* FROM "scores" WHERE "scores"."tutor_id" = 2 AND "scores"."score_type" = 'tcrs' ORDER BY "scores"."computed_at" DESC LIMIT 1

        def intervention_log
          tutor = ::Tutor.find(params[:id])

          # Get all resolved alerts (these represent past interventions)
          interventions = tutor.alerts
            .where(status: 'resolved')
            .order(resolved_at: :desc)
            .limit(20)
            .map do |alert|
---
SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = 2 LIMIT 1
SELECT "alerts".* FROM "alerts" WHERE "alerts"."tutor_id" = 2 AND "alerts"."status" = 'resolved' ORDER BY "alerts"."resolved_at" DESC LIMIT 20