app/controllers/api/admin/tutors/tutors_controller.rb

        def risk_list
          tutors = ::Tutor.all.map do |tutor|
            # Get latest scores for each type
            latest_fsrs = tutor.scores.where(score_type: 'fsrs').order(computed_at: :desc).first
            latest_ths = tutor.scores.where(score_type: 'ths').order(computed_at: :desc).first
            latest_tcrs = tutor.scores.where(score_type: 'tcrs').order(computed_at: :desc).first

            # Count open alerts
            alert_count = tutor.alerts.where(status: 'open').count
---
SELECT "tutors".* FROM "tutors"
SELECT "scores".* FROM "scores" WHERE "scores"."tutor_id" = 1 AND "scores"."score_type" = 'fsrs' ORDER BY "scores"."computed_at" DESC LIMIT 1
SELECT "scores".* FROM "scores" WHERE "scores"."tutor_id" = 1 AND "scores"."score_type" = 'ths' ORDER BY "scores"."computed_at" DESC LIMIT 1
SELECT "scores".* FROM "scores" WHERE "scores"."tutor_id" = 1 AND "scores"."score_type" = 'tcrs' ORDER BY "scores"."computed_at" DESC LIMIT 1
SELECT COUNT(*) FROM "alerts" WHERE "alerts"."tutor_id" = 1 AND "alerts"."status" = 'open'