app/controllers/api/tutor/tutors_controller.rb

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = 1 LIMIT 1
SELECT "scores".* FROM "scores" WHERE "scores"."tutor_id" = 1 AND "scores"."score_type" = 'fsrs' ORDER BY "scores"."computed_at" DESC LIMIT 1
SELECT "scores".* FROM "scores" WHERE "scores"."session_id" IN (149, 299, 298, 7, 154, 300, 301, 302, 171, 303, 176, 192, 57, 69, 237, 245, 101, 105, 272, 121)
---
      def fsqs_latest
        tutor = ::Tutor.find_by(id: params[:id])
        return render json: { error: 'Tutor not found' }, status: :not_found unless tutor

        fsqs_score = ::Score.where(tutor: tutor, score_type: 'fsqs')
                         .order(computed_at: :desc)
                         .first

        return render json: { error: 'No FSQS score found' }, status: :not_found unless fsqs_score

        render json: {
          score: fsqs_score.value.to_f,
          feedback: fsqs_score.components['feedback'] || fsqs_score.components[:feedback] || {},
          session_id: fsqs_score.session_id,
          computed_at: fsqs_score.computed_at

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = 1 LIMIT 1
SELECT "scores".* FROM "scores" WHERE "scores"."session_id" IN (149, 299, 298, 7, 154, 300, 301, 302, 171, 303, 176, 192, 57, 69, 237, 245, 101, 105, 272, 121)
SELECT "scores".* FROM "scores" WHERE "scores"."tutor_id" = 1 AND "scores"."score_type" = 'fsrs' ORDER BY "scores"."computed_at" DESC LIMIT 5
SELECT "students".* FROM "students" WHERE "students"."id" = 25 LIMIT 1
---
      def fsqs_history
        tutor = ::Tutor.find_by(id: params[:id])
        return render json: { error: 'Tutor not found' }, status: :not_found unless tutor

        fsqs_scores = ::Score.where(tutor: tutor, score_type: 'fsqs')
                          .includes(:session)
                          .order(computed_at: :desc)
                          .limit(5)

        history = fsqs_scores.map do |score|
          {
            score: score.value.to_f,
            session_id: score.session_id,
            student_name: score.session&.student&.name,
            date: score.session&.scheduled_start_at,
            computed_at: score.computed_at,
            feedback: score.components['feedback'] || score.components[:feedback] || {}

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = 1 LIMIT 1
---
      def performance_summary
        tutor = ::Tutor.find_by(id: params[:id])

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = 1 LIMIT 1
SELECT "scores".* FROM "scores" WHERE "scores"."session_id" IN (149, 299, 298, 7, 154, 300, 301, 302, 171, 303, 176, 192, 57, 69, 237, 245, 101, 105, 272, 121)
SELECT "students".* FROM "students" WHERE "students"."id" IN (4, 21, 1, 17, 16, 22, 23, 24, 19, 25, 5, 3, 6, 8, 18, 14)
SELECT "students".* FROM "students" WHERE "students"."id" = 24 LIMIT 1
SELECT AVG("scores"."value") FROM "scores" WHERE "scores"."tutor_id" = 1 AND "scores"."score_type" = 'sqs' LIMIT 10
---
      def session_list
        tutor = ::Tutor.find_by(id: params[:id])
        return render json: { error: 'Tutor not found' }, status: :not_found unless tutor

        sessions = ::Session.where(tutor: tutor, status: 'completed')
                        .includes(:student, :scores)
                        .order(scheduled_start_at: :desc)
                        .limit(20)

        session_list = sessions.map do |session|
          sqs_score = session.scores.find { |s| s.score_type == 'sqs' }
          fsqs_score = session.scores.find { |s| s.score_type == 'fsqs' }

          {
            id: session.id,
            date: session.scheduled_start_at,
            student_name: session.student.name,
            sqs: sqs_score&.value&.to_f,
            sqs_label: sqs_score&.components&.dig('label') || sqs_score&.components&.dig(:label),
            fsqs: fsqs_score&.value&.to_f,
            first_session: session.first_session_for_student

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = 1 LIMIT 1
---
      def sqs_actionable_feedback
        tutor = ::Tutor.find_by(id: params[:id])