app/controllers/api/tutor/tutors_controller.rb

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = $1 LIMIT $2  [["id", 110], ["LIMIT", 1]]
---
      def performance_summary
        tutor = ::Tutor.find_by(id: params[:id])

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = $1 LIMIT $2  [["id", 111], ["LIMIT", 1]]
SELECT "scores".* FROM "scores" WHERE "scores"."session_id" IN ($1, $2, $3)  [["session_id", 137], ["session_id", 138], ["session_id", 139]]
SELECT "students".* FROM "students" WHERE "students"."id" IN ($1, $2, $3)  [["id", 122], ["id", 123], ["id", 124]]
---
      def session_list
        tutor = ::Tutor.find_by(id: params[:id])
        return render json: { error: 'Tutor not found' }, status: :not_found unless tutor

        sessions = ::Session.where(tutor: tutor, status: 'completed')
                        .includes(:student, :scores)
                        .order(scheduled_start_at: :desc)
                        .limit(20)