app/jobs/tutor_health_score_job.rb

SELECT "scores".* FROM "scores" WHERE "scores"."tutor_id" = 19 AND "scores"."score_type" = 'ths' AND (computed_at >= '2025-11-05 00:00:00') AND (computed_at <= '2025-11-05 23:59:59.999999') ORDER BY "scores"."id" ASC LIMIT 1
---
    }

    # Check if we already have a THS score for today
    existing_score = Score.where(
      tutor_id: tutor_id,
      score_type: 'ths'
    ).where('computed_at >= ?', Date.today.beginning_of_day)
     .where('computed_at <= ?', Date.today.end_of_day)
     .first

INSERT INTO "scores" ("session_id", "tutor_id", "score_type", "value", "components", "computed_at", "created_at", "updated_at") VALUES (NULL, 19, 'ths', 100.0, '{"reschedule_rate":0.0,"no_show_count":0,"avg_lateness":"0.0","total_sessions":21,"days_of_data":7}', '2025-11-05 16:15:13.689636', '2025-11-05 16:15:13.692797', '2025-11-05 16:15:13.692797') RETURNING "id"
---
      )
    else
      # Create new score
      Score.create!(
        tutor_id: tutor_id,
        session_id: nil,
        score_type: 'ths',
        value: ths.round(2),
        components: components,
        computed_at: Time.current
      )